# parameters
nc: 2  # number of classes
depth_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected
width_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # MobileNetV3-small
  # [from, number, module, args]
  [[-1, 1, Conv3BN, [16, 2]],                         # 0-p1/2
   [-1, 1, InvertedResidual, [16,  16, 3, 2, 1, 0]],  # 1-p2/4
   [-1, 1, InvertedResidual, [24,  72, 3, 2, 0, 0]],  # 2-p3/8
   [-1, 1, InvertedResidual, [24,  88, 3, 1, 0, 0]],  # 3-p3/8
   [-1, 1, InvertedResidual, [40,  96, 5, 2, 1, 1]],  # 4-p4/16
   [-1, 1, InvertedResidual, [40, 240, 5, 1, 1, 1]],  # 5-p4/16
   [-1, 1, InvertedResidual, [40, 240, 5, 1, 1, 1]],  # 6-p4/16
   [-1, 1, InvertedResidual, [48, 120, 5, 1, 1, 1]],  # 7-p4/16
   [-1, 1, InvertedResidual, [48, 144, 5, 1, 1, 1]],  # 8-p4/16
   [-1, 1, InvertedResidual, [96, 288, 5, 2, 1, 1]],  # 9-p5/32
   [-1, 1, InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 10-p5/32
   [-1, 1, InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 11-p5/32
  ]

# YOLOv5 FPN head
head:
  [[-1, 1, C3, [256, False]],  # 12 large

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, C3, [128, False]],  # 16 medium

   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ [ -1, 3 ], 1, Concat, [ 1 ] ],  # cat backbone P3
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, C3, [ 64, False ] ],  # 20 small

   [[20, 16, 12], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]
