# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected
width_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # MobileNetV3-large
  # [from, number, module, args]
  [ [ -1, 1, Conv, [ 16, 3, 2, 1 ] ],                    # 0-P1/2  ch_out, kernel, stride, padding, groups
    [ -1, 1, GhostBottleneckSE, [ 16, 16, 3, 1 ] ],        # 1  ch_out, ch_mid, dw-kernel, stride

    [ -1, 1, GhostBottleneckSE, [ 24, 48, 3, 2 ] ],        # 2-P2/4
    [ -1, 1, GhostBottleneckSE, [ 24, 72, 3, 1 ] ],        # 3

    [ -1, 1, GhostBottleneckSE, [ 40, 72, 3, 2, True ] ],  # 4-P3/8
    [ -1, 1, GhostBottleneckSE, [ 40, 120, 3, 1, True ] ], # 5

    [ -1, 1, GhostBottleneckSE, [ 80, 240, 3, 2 ] ],        # 6-P4/16
    [ -1, 3, GhostBottleneckSE, [ 80, 184, 3, 1 ] ],        # 7
    [ -1, 1, GhostBottleneckSE, [ 112, 480, 3, 1, True ] ],
    [ -1, 1, GhostBottleneckSE, [ 112, 480, 3, 1, True ] ],

    [ -1, 1, GhostBottleneckSE, [ 160, 672, 3, 2, True ] ], # 10-P5/32
    [ -1, 1, GhostBottleneckSE, [ 160, 960, 3, 1 ] ],       # 11
    [ -1, 1, GhostBottleneckSE, [ 160, 960, 3, 1, True ] ],
    [ -1, 1, GhostBottleneckSE, [ 160, 960, 3, 1 ] ],
    [ -1, 1, GhostBottleneckSE, [ 160, 960, 3, 1, True ] ]]


# YOLOv5 head
# the head is still yolov5s, but depth_multiple and width_multiple are set to 1.0, so Conv and C3 need to be changed
# depth_multiple of yolov5s: 0.33, i.e., number of C3: 3 -> 1
# width_multiple of yolov5s: 0.50, i.e., halve the ch_out
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [256, False]],  # 18

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 21 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [256, False]],  # 24 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [512, False]],  # 27 (P5/32-large)

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]