# parameters
# voc 80.0 57.1
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
# batch 48~50
# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, GhostBottleneck, [128, 3, 2, 1]],  # 1-P2/4
   [-1, 3, C3Ghost, [128, True, True]],
   [-1, 1, GhostBottleneck, [256, 3, 2, 1]],  # 3-P3/8
   [-1, 9, C3Ghost, [256, True, True]],
   [-1, 1, GhostBottleneck, [512, 3, 2, 1]],  # 5-P4/16
   [-1, 9, C3Ghost, [512, True, True]],
   [-1, 1, GhostBottleneck, [1024, 3, 2, 0.5]],  # 7-P5/32
   [-1, 1, GhostSPPF, [1024]],
   [-1, 3, C3Ghost, [1024, False, True]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, GhostConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Sum, [2, True]],  # cat backbone P4
   [-1, 3, C3Ghost, [512, False]],  # 13

   [-1, 1, GhostConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Sum, [2, True]],  # cat backbone P3
   [-1, 3, C3Ghost, [256, False]],  # 17 (P3/8-small)

   [-1, 1, nn.MaxPool2d, [3,2,1]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [[-1,6], 1, Sum, [2, True]],
   [-1, 3, C3Ghost, [512, False]],  # 21 (P4/16-medium)

   [-1, 1, nn.MaxPool2d, [3,2,1]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3Ghost, [1024, False]],  # 24 (P5/32-large)

   [[17, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
