# parameters
# voc 77.5 52.9
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [32, 3]],  # 0-P1/2
   [-1, 1, GhostBottleneck, [64, 3, 2, 1.5]],  # 1-P2/4
   [-1, 1, C3Ghost, [64, True, True]],
   [-1, 1, GhostBottleneck, [128, 3, 2, 1.5]],  # 3-P3/8
   [-1, 3, C3Ghost, [128, True, True]],
   [-1, 1, GhostBottleneck, [256, 3, 2, 1.5]],  # 5-P4/16
   [-1, 3, C3Ghost, [256, True, True]],
   [-1, 1, GhostBottleneck, [512, 3, 2, 1]],  # 7-P5/32
   [-1, 1, SPP, [512, [5, 9, 13]]],
   [-1, 1, C3Ghost, [512, False, True]],  # 9 (large)
  ]

# YOLOv5 head
head:
  [[-1, 1, GhostConv, [256, 1, 1]], #10 //降维
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #11
   [[-1, 6], 1, Sum, [2, True]],  # cat backbone P4 #12
   [-1, 1, C3Ghost, [256, False]],  # 13

   [-1, 1, GhostConv, [128, 1, 1]],   #14 //降维
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #15
   [[-1, 4], 1, Sum, [2, True]],  # cat backbone P3  #16
   [-1, 1, C3Ghost, [128, False]],  # 17 (P3/8-small)

   [-1, 1, nn.MaxPool2d, [3,2,1]], #18 //下采样
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [[-1,6], 1, Sum, [2, True]],
   [-1, 1, C3Ghost, [256, False]],  # 21 (P4/16-medium)

   [ -1, 1, nn.MaxPool2d, [3,2,1] ], #22 //下采样
   [ [ -1, 10 ], 1, Concat, [1] ],  # cat head P5
   [ -1, 1, C3Ghost, [ 512, False ] ],  # 24 (P5/32-large)

   [[17, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
