# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [32, 3]],  # 0-P1/2
   [-1, 1, GhostBottleneck, [64, 3, 2]],  # 1-P2/4
   [-1, 1, C3Ghost, [64, True, True]],
   [-1, 1, GhostBottleneck, [128, 3, 2]],  # 3-P3/8
   [-1, 3, C3Ghost, [128, True, True]],
   [-1, 1, GhostBottleneck, [256, 3, 2]],  # 5-P4/16
   [-1, 3, C3Ghost, [256, True, True]],
   [-1, 1, GhostBottleneck, [512, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [512, [5, 9, 13]]],
   [-1, 1, C3Ghost, [256, False]],  # 9 (large)
  ]

# YOLOv5 head
head:
   [[-1, 1, nn.Upsample, [None, 2, 'nearest']], #10
   [[-1, 6], 1, Sum, [2, True]],  # cat backbone P4 #11
   [-1, 1, C3Ghost, [128, False]],  # 12

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #13
   [[-1, 4], 1, Sum, [2, True]],  # cat backbone P3  #14
   [-1, 1, C3Ghost, [128, False]],  # 15 (P3/8-small)

   [-1, 1, nn.MaxPool2d, [3,2,1]], #16 //下采样
   [[-1, 12, 6], 1, Concat, [1]],  # cat head P4 #17
   [-1, 1, C3Ghost, [256, False]],  # 18 (P4/16-medium)

   [ -1, 1, nn.MaxPool2d, [3,2,1] ], #19 //下采样
   [ [ -1, 9 ], 1, Concat, [1] ],  # cat head P5 #20
   [ -1, 1, C3Ghost, [ 512, False ] ],  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
